Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/F44A.tmx
Source language: en_us
Languages: zh_cn

source: The Bright Sagittarian
zh_cn: 聪明的射手座

source: Ordinarily, one would expect the archer to be a perfectionist to the core!
zh_cn: 通常人们会觉得弓箭手是十足的完美主义者！

source: The right precision, the effortless aim, the practiced yet generally confused action!
zh_cn: 丝毫无误，不费吹灰之力的射中目标，行动熟练却令人困惑！

source: That's the Sagittarian for you!
zh_cn: 那就是射手座。

source: Geniuses Galore
zh_cn: 天资聪颖

source: Known to attract a million people across the globe, Sagittarians are typically known like Geminis to make friends instantly.
zh_cn: 同双子座一样，迷倒万千的射手座也是自来熟型，能在短时间内交上朋友。

source: The only difference is that Saggis generally have their astronomically brilliant mind that attracts people to them.
zh_cn: 射手座同双子座的唯一区别在于射手座人通常拥有吸引别人的聪明大脑。

source: Known to be extremely slow, almost lethargic, their precision is unmatched!
zh_cn: 他们经常是反应迟缓，甚至是迟钝，与其精确度不怎么相称。

source: Personally too Sagittarians are absolute emotional people who interestingly use logic to the maximum in almost everything that they do.
zh_cn: 射手座人十分情绪化，有趣的是他们几乎干任何事情都会尽可能的借助逻辑。

source: Like the Archer, Sagittarians are extremely precise in their goals and are known to love logically bright things.
zh_cn: 像弓箭手一样，射手座人对目标一丝不苟且十分热衷于合乎逻辑的聪明事物。

source: They are also great appreciators of art, (read as poetry and the like) as they understand their limitations in fathoming this themselves.
zh_cn: 他们还是伟大的艺术鉴赏家（阅读诗歌之类），因为他们了解自己的不足之处能帮助其彻底了解自己。

source: Being bright and knowing that they are so, they are one zodiac sign like Pisceans who do not believe in blowing their own trumpet.
zh_cn: 聪明且有自知之明，所以他们就像十二星座中的双鱼座一样，从来不会自负。

source: It is no wonder that despite Pisces being an opposite sign, in terms of element, both Sagittarians and Pisceans make a deadly combination, in terms of intellect.
zh_cn: 难怪尽管双鱼座人在元素上与其相对，在智力上射手座和双鱼座却是一对完美组合。

source: Though Virgos also find an equally amicable place under the sun with Saggis, you'll rarely find them without a bunch of friends.
zh_cn: 虽然表面上处女座人同射手座人都非常友善，但是很少他们会有一群朋友。

source: You'll generally notice that most Sagittarians are very well educated and strongly believe that educating themselves is the greatest boon that the human race could be given!
zh_cn: 大部分射手座人都受到过良好教育，并且坚信接受教育是人类得到的最好的恩惠！

source: Since logic remains the foundation for them to stem from, it is no wonder that they love practical subjects like pure sciences and arithmetic to other socio cultural activities.
zh_cn: 因为逻辑是他们的基础，难怪同社会文化活动相比，他们喜欢实用性科目如纯科学和数学。

source: You can generally spot a Sagittarian as they keep to themselves and believe that others should do too.
zh_cn: 你可以发现很多射手座人都坚信这一点同时认为其他人也应该这样。

source: It is perhaps this quality that attracts most of the people from other signs to get attracted to them.
zh_cn: 或许这一品质能为其吸引吸引很多其他星座的人。

source: Besides, they also possess a good sense of humor.
zh_cn: 此外他们很幽默。

source: One of the demerits of this sign is that they are by far an obstinate sign and generally difficult to mold.
zh_cn: 射手座人的缺点是太过于固执且通常难以改变。

source: They have this set number of beliefs and abide by them eternally so!
zh_cn: 他们有自己的信仰并且誓死不变。

source: This also at times reflects their moody nature.
zh_cn: 这也就反映了其喜怒无常的天性。

source: Most of them are moody and it is this swing of moods that makes them mold the other person too.
zh_cn: 绝大部分射手座人都喜怒无常，正是这种摇摆不定的情绪使得他们也影响其他人。

source: Because they believe that certain things need to be done in a particular manner, they try their might in making the other person agree to their terms.
zh_cn: 因为他们认为必须按照特定的方式去办特定的事，所起他们会迫使别人赞同他们的观点。

source: Some of them, well most of them are attention seeking people in their own right.
zh_cn: 他们中很多人，甚至是绝大部分人会凭其本身的实力来吸引别人的注意力。

source: Either they seek attention through their somewhat callous and silent demeanor or by making a hue and cry, in their own inimitable style, they sure do make the world stand up and listen.
zh_cn: 无论是行为冷漠、沉默寡言，还是大喊大叫、大哭大闹，射手座人肯定会其自己的方式让全世界人拥护和听从他们。

source: It is no wonder then that some of the well-known faces worldwide, especially in the world of cinema belong to Sagittarians.
zh_cn: 世界上很多熟悉的面孔，特别是电影界的熟悉面孔都是射手座也就不足为奇了。

source: Exceptionally Bright
zh_cn: 特别聪明

source: Sagittarians have a bit of all signs except for the pride.
zh_cn: 射手座人除了傲慢之外永远几乎全部特征。

source: A trait that finds itself lost amidst the wide variety of colorful characteristics.
zh_cn: 射手座人有时会发现自己丧失在各种多姿多彩的性格中。

source: Most Sagittarians are enveloped in modesty.
zh_cn: 绝大部分的射手座人都很谦虚。

source: What is important for them to note is that they are prone to injuries of some sort or the other.
zh_cn: 值得注意的是他们可能会伤害到自己或其他人。

source: According to the zodiac body chart, they are prone to injuries of the thighs and hips and numerous ankle twists.
zh_cn: 根据十二星座身体图表，他们大腿、臀部和各关节容易受伤。

source: Their loony images make them sway in their own tune making them this susceptible.
zh_cn: 他们疯狂形象使得他们在自己的曲调中摇摆不定，也易受影响。

source: Most of them are poor eaters or prefer a quality of cuisines.
zh_cn: 他们胃口不好或是注重食材的质量。

source: So if you come across a strangely attractive person digging in an interesting science fiction, you know whom you're dealing with!
zh_cn: 如果你遇到一个有吸引力的且沉浸在科幻小说的陌生人，你就知道你在和什么星座的人打交道了。
